Revit 2026 API

# IDropHandler Interface

---

An interface to be executed when custom data is dragged and dropped onto the Revit user interface.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IDropHandler
```
```vb
Public Interface IDropHandler
```
```cpp
public interface class IDropHandler
```
```fsharp
type IDropHandler = interface end
```

The IDropHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to handle the drop event for your data. |

Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.

#### Reference

Autodesk.Revit.UI Namespace